{
  "id": "school--cscc69--ostep--part-1-virtualization--4-the-process",
  "path": "school/cscc69/ostep/part-1-virtualization/4-the-process",
  "title": "4. The Process",
  "content": "**An abstraction provided by the operating system of a running program** \n\n> We have a lot more running programs than available CPUs, how can the OS create the illusion of an endless supply?\n# Definitions\n\n**Mechanisms**: Low-level machinery. Low-level methods and protocols that implement some piece of functionality. \n**Machine State**: What a program can read or update whilst it's running\n**Address Space**: The memory that a process can address\n### Time Sharing (of the CPU)\n\nBy running one process, stopping it and then running another - and repeating this for a large number of processes - the OS makes it seem like we have loads of *virtual* CPUs.\n\nThe benefit is that we can run many concurrent processes at once. Of course, the obvious drawback is performance, each program will run more slowly depending on the process to cpu ratio.\n#### Going from program to process\n\nBefore execution program is simply a sequence of instructions together with the data stored in disk.\n\n<img src=\"/images/Screenshot 2026-01-02 at 1.21.26 PM.png\" alt=\"Screenshot 2026 01 02 at 1.21.26 PM\" />\n\n1. Add an entry for this process in the process list\n2. Load program code and any static data into memory, into the process address space\n\t1. The OS does this lazily with **paging** and **swaping**\n3. Allocate memory for the program's run-time stack and (maybe) heap\n4. Start the program at it's entry point\n#### Process States\n\n1. **Running:**  Process is running on a processor and executing instructions\n2. **Ready**: OS decided not to run for some reason\n3. **Blocked**: Process does some kind of operation (such as file I/O) that means it can't run until some other event happens\n\n#### Process List\n\nA process list contains information about all processes in the system. Each entry is found in what is sometimes called a process control block (PCB), which is really just a structure that contains information about a specific process.",
  "metadata": {
    "date": "2026-01-16",
    "updated": "2026-01-16"
  },
  "images": [
    "/images/Screenshot 2026-01-02 at 1.21.26 PM.png"
  ],
  "links": []
}