{
  "id": "school--cscc24--lectures--week-1",
  "path": "school/cscc24/lectures/week-1",
  "title": "Week 1",
  "content": "# Lecture Notes\n\nLanguage is an arbitrary collection of forms with their meanings.\n- Syntax: specification of the forms\n- Semantics: specification of the meanings\n## Translation\n\nThe process of converting a program written in a high-level language into machine language is called **translation**. It is composed of the following parts:\n\n1. Lexical analysis converts source code into sequence of tokens\n\t1. Regular expressions, finite state automata\n2. Syntactic analysis structures tokens into initial parse tree\n\t1. CFGs, push-down automata\n3. Semantic analysis annotates parse tree with semantic actions\n4. Code generation produces final machine code\n\nParts 1 & 2, are usually just grouped into one step (at least when referencing these stages) called parsing.\n\nThere are two general methods for **translation**.\n1. Compilation: The whole program is translated before execution\n2. Interpretation: Translate and execute, one statement at a time\n#### Compilation\n\n- Program execution is faster since:\n\t- the compilation overhead has already been done. \n\t- the translator can do optimizations\n\t- can get rid of information that isn't useful for run-time\n- It's harder to provide feedback while debugging because we aren't directly executing the target\n- Less portable to different OS / arch.\n#### Interpretation\n\n- Lower program execution\n- We have to retranslate for each execution\n- More space needed at execution time\n- Portable!\n#### Pseudo-Compilation\n\nA mix of compilation and interpretation\n\n- A compiler translates the whole program before execution, but only into intermediate code\n- An interpreter translates and executes the intermediate code one statement at a time\n- The intermediate code can be executed on any machine that has an interpreter for the intermediate code\n#### JIT Compilation\n\n- Runs in the interpreter\n- Compile at run-time\n\t- Meaning that we compile on an \"as-needed\" basis. We compile stuff that runs often.\n## PL Syntax\n\n**Lexical Rules** specify the form of the building blocks of the language:\n- what's a token\n- how tokens are delimited\n- where white space can go\n- how comments are specified\n\n**Syntax Rules** specify how to put the building blocks together.\n# Bonus \n\n## Donald Knuth\n\n- Think of programs as a piece of literature addressed to human beings rather than a computer\n\n",
  "metadata": {
    "date": "2026-02-11",
    "updated": "2026-02-11"
  },
  "images": [],
  "links": []
}